Конфигурация/src/Documents/СпецификацияПродукции/СпецификацияПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпецификацияПродукции</name>
  <registerRecords>InformationRegister.СпецификацииПродукции</registerRecords>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияИМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродукцииНаБазу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаПродукции</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/СпецификацииПродукции/СпецификацииПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииПродукции</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоМатериала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>КоличествоПродукцииНаБазу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаПродукции</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияИМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.ПродукцияИМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Documents/СпецификацияПродукции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// 1. Указываем, что документ будет записывать движения в регистр
    Движения.СпецификацииПродукции.Записывать = Истина;
    
    // 2. Проверка заполнения шапки
    Если Не ЗначениеЗаполнено(Продукция) Или КоличествоПродукцииНаБазу <= 0 Тогда
        Отказ = Истина;
        Сообщить("Необходимо заполнить Продукцию и Базовое количество.");
        Возврат;
    КонецЕсли;
    
    // 3. Перенос строк из табличной части в Регистр Сведений
    Для Каждого СтрокаТЧ Из СоставМатериалов Цикл
        
        Если Не ЗначениеЗаполнено(СтрокаТЧ.Материал) Или СтрокаТЧ.КоличествоМатериала <= 0 Тогда
            Продолжить; // Пропускаем пустые или нулевые строки
        КонецЕсли;
        
        // Создаем новую запись в Регистре Сведений
        Движение = Движения.СпецификацииПродукции.Добавить();
        
        // Заполняем поле Период (важно для истории!)
        Движение.Период = Дата; 
        
        // 4. Заполнение Измерений (ключей)
        Движение.Продукция = Продукция;
        Движение.Материал = СтрокаТЧ.Материал;
        
        // 5. Заполнение Ресурсов и Реквизитов (данных)
        Движение.КоличествоМатериала = СтрокаТЧ.КоличествоМатериала;
        Движение.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
        
        Движение.КоличествоПродукцииНаБазу = КоличествоПродукцииНаБазу;
        Движение.ЕдиницаПродукции = ЕдиницаПродукции;
        
    КонецЦикла;
КонецПроцедуры
